<?xml version="1.0" ?>
<net name="road-segmentation-adas-0001" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 512, 896"/>
			<output>
				<port id="0" names="data" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>896</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="373" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="16, 3, 3, 3" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="L0000_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>896</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="L0000_Conv2d_BN/Dims5753" type="Const" version="opset1">
			<data element_type="f32" offset="1728" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="L0000_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0000_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="L0001_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0001_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="555" type="Const" version="opset1">
			<data element_type="f32" offset="1792" shape="8, 16, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="L0002_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="L0002_Conv2d_BN/Dims6479" type="Const" version="opset1">
			<data element_type="f32" offset="2304" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="L0002_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0002_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="L0003_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0003_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="335" type="Const" version="opset1">
			<data element_type="f32" offset="2336" shape="8, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="L0004_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="L0004_Conv2d_BN/Dims6323" type="Const" version="opset1">
			<data element_type="f32" offset="2624" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="L0004_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0004_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="L0005_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0005_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="397" type="Const" version="opset1">
			<data element_type="f32" offset="2656" shape="16, 8, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="L0006_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="L0006_Conv2d_BN/Dims5963" type="Const" version="opset1">
			<data element_type="f32" offset="3168" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="L0006_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0006_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="L0007_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0007_AddBackward1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="L0008_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0008_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="351" type="Const" version="opset1">
			<data element_type="f32" offset="3232" shape="8, 16, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="L0009_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="L0009_Conv2d_BN/Dims5945" type="Const" version="opset1">
			<data element_type="f32" offset="3744" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="L0009_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0009_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="L0010_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0010_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="531" type="Const" version="opset1">
			<data element_type="f32" offset="3776" shape="8, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="L0011_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="L0011_Conv2d_BN/Dims6257" type="Const" version="opset1">
			<data element_type="f32" offset="4064" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="L0011_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0011_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="L0012_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0012_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="435" type="Const" version="opset1">
			<data element_type="f32" offset="4096" shape="24, 8, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="L0013_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="L0013_Conv2d_BN/Dims5789" type="Const" version="opset1">
			<data element_type="f32" offset="4864" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="L0013_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0013_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="491" type="Const" version="opset1">
			<data element_type="f32" offset="4960" shape="24, 16, 1, 1" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="L0014_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="L0014_Conv2d_BN/Dims6437" type="Const" version="opset1">
			<data element_type="f32" offset="6496" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="L0014_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0014_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="L0015_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0015_AddBackward1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="L0016_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0016_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="329" type="Const" version="opset1">
			<data element_type="f32" offset="6592" shape="8, 24, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="L0017_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="L0017_Conv2d_BN/Dims6119" type="Const" version="opset1">
			<data element_type="f32" offset="7360" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="L0017_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0017_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="L0018_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0018_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="551" type="Const" version="opset1">
			<data element_type="f32" offset="7392" shape="8, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="L0019_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="L0019_Conv2d_BN/Dims6473" type="Const" version="opset1">
			<data element_type="f32" offset="7680" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="L0019_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0019_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="L0020_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0020_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="379" type="Const" version="opset1">
			<data element_type="f32" offset="7712" shape="24, 8, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="L0021_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="L0021_Conv2d_BN/Dims6341" type="Const" version="opset1">
			<data element_type="f32" offset="8480" shape="1, 24, 1, 1" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="L0021_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0021_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="L0022_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0022_AddBackward1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="L0023_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0023_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="535" type="Const" version="opset1">
			<data element_type="f32" offset="8576" shape="8, 24, 1, 1" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="L0024_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="L0024_Conv2d_BN/Dims6269" type="Const" version="opset1">
			<data element_type="f32" offset="9344" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="L0024_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0024_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="L0025_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0025_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="557" type="Const" version="opset1">
			<data element_type="f32" offset="9376" shape="8, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="L0026_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="L0026_Conv2d_BN/Dims5873" type="Const" version="opset1">
			<data element_type="f32" offset="9664" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="L0026_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0026_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="L0027_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0027_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="571" type="Const" version="opset1">
			<data element_type="f32" offset="9696" shape="32, 8, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="L0028_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="L0028_Conv2d_BN/Dims6095" type="Const" version="opset1">
			<data element_type="f32" offset="10720" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="L0028_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0028_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="449" type="Const" version="opset1">
			<data element_type="f32" offset="10848" shape="32, 24, 1, 1" size="3072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="L0029_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="L0029_Conv2d_BN/Dims5807" type="Const" version="opset1">
			<data element_type="f32" offset="13920" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="L0029_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0029_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="L0030_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0030_AddBackward1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="L0031_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0031_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="597" type="Const" version="opset1">
			<data element_type="f32" offset="14048" shape="8, 32, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="L0032_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="L0032_Conv2d_BN/Dims5927" type="Const" version="opset1">
			<data element_type="f32" offset="15072" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="L0032_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0032_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="L0033_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0033_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="489" type="Const" version="opset1">
			<data element_type="f32" offset="15104" shape="8, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="L0034_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="L0034_Conv2d_BN/Dims6221" type="Const" version="opset1">
			<data element_type="f32" offset="15392" shape="1, 8, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="L0034_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0034_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="L0035_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0035_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="399" type="Const" version="opset1">
			<data element_type="f32" offset="15424" shape="32, 8, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="L0036_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="L0036_Conv2d_BN/Dims5969" type="Const" version="opset1">
			<data element_type="f32" offset="16448" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="L0036_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0036_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="L0037_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0037_AddBackward1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="L0038_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0038_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="347" type="Const" version="opset1">
			<data element_type="f32" offset="16576" shape="16, 32, 2, 2" size="8192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="L0039_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="L0039_Conv2d_BN/Dims5699" type="Const" version="opset1">
			<data element_type="f32" offset="24768" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="L0039_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0039_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="L0040_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0040_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="325" type="Const" version="opset1">
			<data element_type="f32" offset="24832" shape="16, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="L0041_Conv2d_BN/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="L0041_Conv2d_BN/Dims5933" type="Const" version="opset1">
			<data element_type="f32" offset="25408" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="L0041_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0041_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="L0042_ReLU" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0042_ReLU" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="433" type="Const" version="opset1">
			<data element_type="f32" offset="25472" shape="48, 16, 1, 1" size="3072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="L0043_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="L0043_Conv2d_BN/Dims6185" type="Const" version="opset1">
			<data element_type="f32" offset="28544" shape="1, 48, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="L0043_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0043_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="L0044_MaxPool2d" type="MaxPool" version="opset1">
			<data auto_pad="explicit" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="ceil" strides="2, 2"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" names="L0044_MaxPool2d" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="533" type="Const" version="opset1">
			<data element_type="f32" offset="28736" shape="48, 32, 1, 1" size="6144"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="L0045_Conv2d_BN/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="L0045_Conv2d_BN/Dims6263" type="Const" version="opset1">
			<data element_type="f32" offset="34880" shape="1, 48, 1, 1" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="L0045_Conv2d_BN" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="L0045_Conv2d_BN" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>128</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="L0046_AddBackward1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
