{
  "class_name": "Model",
  "keras_version": "1.2.2",
  "config": {
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10
          ],
          "input_dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": [],
        "name": "input_2"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_16",
          "activity_regularizer": null,
          "trainable": true,
          "init": "one",
          "bias": true,
          "input_dim": 10,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "linear",
          "output_dim": 5
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0
            ]
          ]
        ],
        "name": "dense_16"
      },
      {
        "class_name": "Activation",
        "config": {
          "activation": "relu",
          "trainable": true,
          "name": "activation_15"
        },
        "inbound_nodes": [
          [
            [
              "dense_16",
              0,
              0
            ]
          ]
        ],
        "name": "activation_15"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_11"
        },
        "inbound_nodes": [
          [
            [
              "activation_15",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_11"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_17",
          "activity_regularizer": null,
          "trainable": true,
          "init": "one",
          "bias": true,
          "input_dim": 5,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "relu",
          "output_dim": 3
        },
        "inbound_nodes": [
          [
            [
              "dropout_11",
              0,
              0
            ]
          ]
        ],
        "name": "dense_17"
      },
      {
        "class_name": "Dropout",
        "config": {
          "p": 0.2,
          "trainable": true,
          "name": "dropout_12"
        },
        "inbound_nodes": [
          [
            [
              "dense_17",
              0,
              0
            ]
          ]
        ],
        "name": "dropout_12"
      },
      {
        "class_name": "Dense",
        "config": {
          "W_constraint": null,
          "b_constraint": null,
          "name": "dense_18",
          "activity_regularizer": null,
          "trainable": true,
          "init": "one",
          "bias": true,
          "input_dim": 3,
          "b_regularizer": null,
          "W_regularizer": null,
          "activation": "linear",
          "output_dim": 2
        },
        "inbound_nodes": [
          [
            [
              "dropout_12",
              0,
              0
            ]
          ]
        ],
        "name": "dense_18"
      }
    ],
    "input_layers": [
      [
        "input_2",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_18",
        0,
        0
      ]
    ],
    "name": "model_1"
  }
}