{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "input_dtype": "int32", "sparse": false, "name": "user_input"}, "inbound_nodes": [], "name": "user_input"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "input_dtype": "int32", "sparse": false, "name": "item_input"}, "inbound_nodes": [], "name": "item_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "mlp_embedding_user", "activity_regularizer": null, "W_constraint": null, "init": "init_normal", "input_dtype": "int32", "mask_zero": false, "input_dim": 6040, "batch_input_shape": [null, 1], "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "dropout": 0.0, "output_dim": 8, "input_length": 1}, "inbound_nodes": [[["user_input", 0, 0]]], "name": "mlp_embedding_user"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "mlp_embedding_item", "activity_regularizer": null, "W_constraint": null, "init": "init_normal", "input_dtype": "int32", "mask_zero": false, "input_dim": 3706, "batch_input_shape": [null, 1], "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "dropout": 0.0, "output_dim": 8, "input_length": 1}, "inbound_nodes": [[["item_input", 0, 0]]], "name": "mlp_embedding_item"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "mf_embedding_user", "activity_regularizer": null, "W_constraint": null, "init": "init_normal", "input_dtype": "int32", "mask_zero": false, "input_dim": 6040, "batch_input_shape": [null, 1], "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "dropout": 0.0, "output_dim": 8, "input_length": 1}, "inbound_nodes": [[["user_input", 0, 0]]], "name": "mf_embedding_user"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "mf_embedding_item", "activity_regularizer": null, "W_constraint": null, "init": "init_normal", "input_dtype": "int32", "mask_zero": false, "input_dim": 3706, "batch_input_shape": [null, 1], "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "dropout": 0.0, "output_dim": 8, "input_length": 1}, "inbound_nodes": [[["item_input", 0, 0]]], "name": "mf_embedding_item"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["mlp_embedding_user", 0, 0]]], "name": "flatten_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["mlp_embedding_item", 0, 0]]], "name": "flatten_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["mf_embedding_user", 0, 0]]], "name": "flatten_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["mf_embedding_item", 0, 0]]], "name": "flatten_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["flatten_3", 0, 0], ["flatten_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "mul", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "layer1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 16, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu", "output_dim": 8}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "layer1"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_1", 0, 0], ["layer1", 0, 0]]], "name": "merge_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "prediction", "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dim": 16, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "prediction"}], "input_layers": [["user_input", 0, 0], ["item_input", 0, 0]], "output_layers": [["prediction", 0, 0]], "name": "model_1"}}