name: "convolution"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 5
input_dim: 5
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 4
    kernel_size: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "gaussian"
      std: 0.02
    }
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv"
  top: "conv2"
  convolution_param {
    num_output: 3
    kernel_size: 2
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "conv2"
  top: "out"
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
